backend/src/tests/load/artillery-config.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up — Cold Start"
    - duration: 120
      arrivalRate: 50
      name: "Sustained Load — 3000 RPS Baseline"
  payload:
    path: "./test-users.csv"
    fields:
      - "email"
      - "password"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Feed Engagement Flow"
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
      - get:
          url: "/api/v1/feed"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/v1/profile/me"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2